use mydb; 
delimiter $$
drop procedure if exists performance_list$$ 
create procedure performance_list(in t text) 
begin
declare n , p int default 0;
select idПостановка into n from Постановка 
where Постановка.Назва=t; select idВистави into p from Вистави 
where idПостановка= n limit 1; select "Дата Прем'єри", Премєра from Постановка 
where Постановка.Назва=t union
select "Режисер", Персонал.ПІБ from Постановник, Персонал, Постановка
where Постановник.idПерсонал=Персонал.idПерсонал and Постановка.Режисер=Постановник.idПостановник 
and Постановка.idПостановка=n union select "Художник", Персонал.ПІБ 
from Постановник, Персонал, Постановка where Постановник.idПерсонал=Персонал.idПерсонал 
and Постановка.Художник=Постановник.idПостановник and Постановка.idПостановка=n union
select "Дирижер", Персонал.ПІБ from Постановник, Персонал, Постановка
where Постановник.idПерсонал=Персонал.idПерсонал and
Постановка.Дирижер=Постановник.idПостановник and Постановка.idПостановка=n union
select Роль.Імя, Персонал.ПІБ from Роль, ЗіграніРолі, Актор, Персонал 
where ЗіграніРолі.idВистави=p and ЗіграніРолі.Дублер=0 and ЗіграніРолі.idРоль=Роль.idРоль 
and ЗіграніРолі.idАктор=Актор.idАктор and Актор.idПерсонал=Персонал.idПерсонал;
end$$
call performance_list('Корсиканка'); 
#Task9--------------------------------------------------------------
